{
  "experiences": [
    {
      "experience_type": "Project",
      "title": "Software Engineer Intern",
      "subtitle": "American Honda Motor Company, Inc. (June 2024 - August 2024)",
      "short_description": "Conducted on-device AI research for automotive applications.",
      "long_description": "Conducted comprehensive research on on-device generative AI, focusing on its potential applications within the automotive industry to enhance vehicle functionalities. Developed and demonstrated applications on an NVIDIA Jetson Orin Nano 8GB using Linux and CUDA, showcasing on-device generative AI capabilities with Meta's Llama 3 model to enhance vehicle autonomy and local AI performance.",
      "main_link": "https://www.honda.com/",
      "main_image": "honda.svg",
      "tile_size": "1x2"
    },
    {
      "experience_type": "Work",
      "title": "Data Engineer",
      "subtitle": "CUSCO USA Inc. (October 2021 - May 2024)",
      "short_description": "Led a team to develop Python apps extracting data from PDFs.",
      "long_description": "Led a three-member team in developing a Python application that extracted data from 11,560 archived PDF files, utilizing advanced software development methodologies. Demonstrated proficiency in testing and development, including the creation of comprehensive test cases to ensure software quality and functionality. Enhanced user access to historical data dating back to 1977, resulting in a 30% increase in revenue by enabling precise retrieval of previously inaccessible information for new users.",
      "main_link": "https://cuscousainc.com/",
      "main_image": "cusco.svg",
      "tile_size": "1x1"
    },
    {
      "experience_type": "Work",
      "title": "Full Stack Web Developer",
      "subtitle": "CUSCO USA Inc. (October 2021 - May 2024)",
      "short_description": "Developed a website with Svelte/SvelteKit.",
      "long_description": "Collaborated with a team of 2 to develop a modern website utilizing Svelte with Svelte Kit, focusing on UI and information accessibility, resulting in a 50% reduction in exit rate. Implemented data management systems including Google Drive, Cloudinary, and Sanity for efficient content organization and delivery, leading to a 250% increase in revenue over the past three years.",
      "main_link": "https://cuscousainc.com/",
      "main_image": "cusco.svg",
      "tile_size": "2x1"
    },
    {
      "experience_type": "Work",
      "title": "Data Engineer",
      "subtitle": "FUJITSUBO GIKEN KOGYO CO., LTD (Sept 2023 - Nov 2023)",
      "short_description": "Python-based scraper to automate data extraction.",
      "long_description": "Engineered a Python-based software program employing web scraping techniques to meticulously extract crucial data from diverse websites. Automated generation workflows with Adobe InDesign, significantly boosting efficiency and achieving a 100% error-free rate by eliminating manual effort across various cases, ensuring software quality and functionality.",
      "main_link": "https://www.fujitsubo.co.jp/",
      "main_image": "fujitsubo.svg",
      "tile_size": "1x1"
    },
    {
      "experience_type": "Work",
      "title": "Co-PM and Developer",
      "subtitle": "Matcha Time (March 2024 - April 2024)",
      "short_description": "Swift/SwiftUI project with multi-city sync.",
      "long_description": "Developed and created application functions with Swift/SwiftUI, implemented multi-city synchronization, designed and tested features, fixed bugs, and deployed solutions. Planned and completed the project in 4 weeks, launched the application on the Mac App Store, and managed cross-functional team collaboration to ensure seamless integration and project success.",
      "main_link": "https://apps.apple.com/us/app/matcha-time/id6497067918?mt=12",
      "main_image": "matchatime.svg",
      "tile_size": "2x2"
    },
    {
      "experience_type": "Project",
      "title": "Developer",
      "subtitle": "Poker Percentage (Jan 2022 - Apr 2024)",
      "short_description": "WatchOS app for real-time poker odds.",
      "long_description": "Developed a poker percentage calculator application for watchOS using Swift and WatchKit, facilitating real-time calculation of odds and probabilities. Improved user decision-making by providing accurate insights into poker hands, resulting in a 15% increase in win rates among users.",
      "main_link": "https://apps.apple.com/us/app/poker-pocket-odds/id6499280318",
      "main_image": "poker.png",
      "tile_size": "1x1"
    },
    {
      "experience_type": "Project",
      "title": "Developer",
      "subtitle": "Schedule Mastermind (Dec 2023 - Feb 2024)",
      "short_description": "Scheduling with Python & Flask.",
      "long_description": "Engineered a Python-based application with the Flask framework, streamlining scheduling operations for over 500 classes. Created a user-friendly interface for course selection, timetable generation, and conflict resolution, achieving a 100% reduction in scheduling errors and boosting overall productivity by 25% through automation.",
      "main_link": "/app1",
      "main_image": "schedule.jpg",
      "tile_size": "2x1"
    },
    {
      "experience_type": "Project",
      "title": "Developer and Project Leader",
      "subtitle": "Shohei Home Ground (Mar 2023 - Nov 2023)",
      "short_description": "Automated Instagram posting, +11k followers.",
      "long_description": "Engineered and deployed a streamlined content scheduling and posting process using Python and the Instagram API, achieving 685 posts and increasing followers by 11,000 in 8 months. Transformed the project from a non-revenue-generating initiative to a profitable venture by enhancing engagement and expanding the audience.",
      "main_link": "https://www.instagram.com/shoheihomeground/",
      "main_image": "shoheihomeground.svg",
      "tile_size": "1x1"
    },
    {
      "experience_type": "Leadership",
      "title": "Trainer",
      "subtitle": "Amazon Web Services (Sept 2023 - Nov 2023)",
      "short_description": "AWS cloud infrastructure training.",
      "long_description": "Provided training sessions to professionals on Amazon Web Services, imparting knowledge on cloud infrastructure and services.",
      "main_link": "/",
      "main_image": "aws.png",
      "tile_size": "1x1"
    },
    {
      "experience_type": "Publication",
      "title": "6G Network and Data Management with Blockchain",
      "subtitle": "Research Paper (Sept 2024)",
      "short_description": "Research on AWS & Blockchain for 6G networks.",
      "long_description": "Provided training sessions to professionals on Amazon Web Services, imparting knowledge on cloud infrastructure and services.",
      "main_link": "https://docs.google.com/document/d/1K49_6etVnN7hcCNUc1l-0wJpp3B-NT9J/edit?usp=sharing",
      "main_image": "resume.png",
      "tile_size": "2x1"
    }
  ]
}
